"""
После затянувшегося совещания директор фирмы решил заказать такси,
чтобы развезти сотрудников по домам.
Он заказал N машин — ровно столько, сколько у него сотрудников.
Однако когда они подъехали, оказалось, что у каждого водителя такси свой тариф за 1 километр.

Директор знает, какому сотруднику сколько километров от работы до дома.
Теперь директор хочет определить, сколько придется заплатить за перевозку всех сотрудников.
Естественно, директор хочет заплатить как можно меньшую сумму.

Формат ввода:
    В первой строке записаны N чисел через пробел,
    задающих расстояния в километрах от работы до домов сотрудников компании.
    Во второй строке записаны N чисел — тарифы за проезд одного километра в такси.

Формат вывода:
    Выведите одно целое число — наименьшую сумму, которую придется заплатить за доставку всех сотрудников.
"""

rast = list(map(int, input().split()))
cost = list(map(int, input().split()))
rast.sort(key=lambda x: -x)
cost.sort()
summa = 0
for i in range(len(rast)):
    summa += rast[i] * cost[i]
print(summa)
